---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartOptimizeInvalidConnection
source: html/868fe4bb-9e17-530b-9706-2a1d9be6976f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartOptimizeInvalidConnection Property

No available couplings to connect standard lengths for this instance of straight.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartOptimizeInvalidConnection { get; }
```